{
  "consent_id": "manga",
  "title": "Manga Research Consent Form",
  "sections": {
    "Introduction": "You and your child are invited to participate in an online study that is being conducted by Dr. \nKang Lee’s Development Lab at the University of Toronto. In this study, we will be examining \nteenagers' manga reading experiences. The study will involve one session which will take \napproximately 15 minutes of you and your child’s time. Please read the following information \nPage 3 of 37\nprovided to get a fuller understanding about the tasks of the study and what you and your child’s \nrole would be in our research.",
    "Purpose of the Study": "We are conducting this study to better understand 13- to 17-year-old teenagers’ social and \nemotional experiences in relation to reading manga. Your child is eligible for this study if they fall \nwithin the age group. In addition, your child is eligible for this study if they have ever read \nmanga.",
    "Study Procedures": "This study asks your child to fill out a questionnaire about their experiences with fictional \nmediums, reading manga, and their general state. You will later be asked to fill out a \nquestionnaire regarding some demographic information, your assessment of your child’s \nexperiences, and your own reading experiences. ",
    "Voluntary Participation": "Participation in the study is completely voluntary. You and your child may withdraw from the \nsession at any time, for any reason, without loss of compensation which will be given to all \nparticipants regardless of performance or completion of tasks. If you have any questions about \nyou or your child’s rights as a research participant, you may contact the Office of Research \nEthics at (416) 946-3273 or ethics.research@utoronto.ca.",
    "Confidentiality": "All information gathered for the study will remain confidential by removing links between data \nand you/your child’s identity, unless required for legal reasons. All collected data will be \ncombined with those of other participants, and only group results will be reported. In \nappreciation for your child taking part in our study, your child will receive a $5 Indigo e-gift card. \nIn appreciation for you taking part in our study, you will receive a $5 Amazon e-gift card",
    "Contact Information": "Thank you for your interest in our research. If you have any questions, concerns, or would like \nto participate in this study, please contact us at MangaEngagement@kangleelab.ca. "
  }
}
