{
  "title": "Non-Alchoholic Fatty Liver Disease (NAFLD) prediction",
  "description": "This applet computes an individuals likelihood of NAFLD. Based on 20 physical measures and blood biomarkers, this app uses a machine learning model to compute the likelihood of NAFLD.<br>Non-alcoholic fatty liver disease (NAFLD) is becoming a major global burden of disease, but its diagnosis based on liver biopsy is invasive and expensive. This study aimed to investigate the feasibility of using patient physical and blood biomarkers to build computational models to predict NAFLD risks accurately.<br>We obtained a large dataset (N=120,376) containing patients’ physical and blood measurements, and their NAFLD status based on the invasive liver biopsy. Using this dataset, the most important patient physical and blood biomarkers were extracted using feature selection techniques. Then, using the most important features, six different machine learning algorithms trained and tested models that predict the NAFLD status. Finally, these models were validated with a pristine set of patient data never used in model training and testing, and SHAP (SHapley Additive exPlanations) analysis was performed on the final model.<br>We identified the top 20 features for predicting NAFLD risk including Weight, BMI, Alanine aminotransferase, and HDL Cholesterol. Our best machine learning model using the Extreme Gradient Boosting Decision Tree (XGB) technique achieved 84.94% area under the curve (ROC AUC), and 82.58% accuracy (88.75% sensitivity and 81.13% specificity) for predicting NAFLD status<br>Our findings suggest that machine learning models based on patient physical and blood biomarkers provide a viable, non-invasive, and inexpensive method to assess patients’ risks for non-alcoholic fatty liver disease accurately.",
  "questions": {
    "Age": { "selectionType": "integer" },
    "Gender:": {
      "selectionType": "dropdown",
      "selections": ["Male", "Female"]
    },
    "Weight (kg)": { "selectionType": "integer" },
    "Height (cm)": { "selectionType": "integer" },
    "HDL cholesterol (mmol/L):": { "selectionType": "float" },
    "Triglycerides (mmol/L):": { "selectionType": "float" },
    "Diastolic blood pressure (mmHg):": { "selectionType": "float" },
    "Systolic blood pressure (mmHg):": { "selectionType": "float" },
    "The average hemoglobin concentration (g/L):": { "selectionType": "float" },
    "Red blood cell count (trillion/L):": { "selectionType": "float" },
    "Platelet count (thousands/µL):": { "selectionType": "float" },
    "Alanine aminotransferase (IU/L):": { "selectionType": "float" },
    "White blood cell count (billions/L):": { "selectionType": "float" },
    "Lymphocyte count (billions/L):": { "selectionType": "float" },
    "Eosinophil count (billions/L):": { "selectionType": "float" },
    "Total bilirubin (mg/L):": { "selectionType": "float" },
    "Cholinesterase (U/mL):": { "selectionType": "integer" },
    "Leucine aminopeptidase (U/mL):": { "selectionType": "integer" },
    "Alkaline phosphatase (IU/L):": { "selectionType": "integer" }
  }
}
